pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxEray_bf.h
/**
 * \file IfxEray_bf.h
 * \brief
 * \copyright Copyright (c) 2020 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC33X32X_UM_V1.4.0.R0
 * Specification: TC3xx User Manual.V1.4.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Eray_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Eray_Registers
 * 
 */
#ifndef IFXERAY_BF_H
#define IFXERAY_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Eray_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_LEN (3u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_OFF (8u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_OFF (0u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_OFF (1u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_OFF (2u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_OFF (3u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_OFF (4u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_OFF (7u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_LEN (2u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_OFF (10u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_LEN (2u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_OFF (12u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_LEN (2u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_OFF (14u)

/** \brief Length for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_ERAY_ID_Bits.MOD_NUMBER */
#define IFX_ERAY_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_ERAY_ID_Bits.MOD_NUMBER */
#define IFX_ERAY_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_ERAY_ID_Bits.MOD_NUMBER */
#define IFX_ERAY_ID_MOD_NUMBER_OFF (16u)

