pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC32xA/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_OFF (0u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_OFF (1u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_OFF (2u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_OFF (3u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_OFF (4u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_OFF (5u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_OFF (6u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_OFF (7u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_OFF (8u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_OFF (9u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_OFF (10u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_OFF (11u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_OFF (12u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_OFF (13u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_OFF (14u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_OFF (15u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_OFF (16u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_OFF (17u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_OFF (18u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_OFF (19u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_OFF (20u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_OFF (21u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_OFF (22u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_OFF (23u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_OFF (24u)

